jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/hal/hal_com_phycfg.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2011 Realtek Corporation. All rights reserved.
 *                                        
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110, USA
 *
 *
 ******************************************************************************/
#define _HAL_COM_PHYCFG_C_

#include <drv_types.h>
#include <hal_data.h>


s32
phy_TxPwrIdxToDbm(
	IN	PADAPTER		Adapter,
	IN	WIRELESS_MODE	WirelessMode,
	IN	u8				TxPwrIdx
	)
{
	s32				Offset = 0;
	s32				PwrOutDbm = 0;
	
	switch(WirelessMode)
	{
	case WIRELESS_MODE_B:
		Offset = -7;		
		break;

	case WIRELESS_MODE_G:
	case WIRELESS_MODE_N_24G:
		Offset = -8;
		break;
		
	default:
		break;		
	}

	PwrOutDbm = TxPwrIdx / 2 + Offset;

	return PwrOutDbm;
}

u8
PHY_GetTxPowerByRateBase(
	IN	PADAPTER		Adapter,
	IN	u8				Band,
	IN	u8				RfPath,
	IN	u8				TxNum,
	IN	RATE_SECTION	RateSection
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u8 			value = 0;

	if ( RfPath > ODM_RF_PATH_D )
	{
		DBG_871X("Invalid Rf Path %d in PHY_GetTxPowerByRateBase()\n", RfPath );
		return 0;
	}
	
	if ( Band == BAND_ON_2_4G )
	{
		switch ( RateSection ) {
			case CCK:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][0];
				break;
			case OFDM:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][1];
				break;
			case HT_MCS0_MCS7:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][2];
				break;
			case HT_MCS8_MCS15:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][3];
				break;
			case HT_MCS16_MCS23:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][4];
				break;
			case HT_MCS24_MCS31:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][5];
				break;
			case VHT_1SSMCS0_1SSMCS9:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][6];
				break;
			case VHT_2SSMCS0_2SSMCS9:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][7];
				break;
			case VHT_3SSMCS0_3SSMCS9:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][8];
				break;
			case VHT_4SSMCS0_4SSMCS9:
				value = pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][9];
				break;
			default:
				DBG_871X("Invalid RateSection %d in Band 2.4G, Rf Path %d, %dTx in PHY_GetTxPowerByRateBase()\n", 
						 RateSection, RfPath, TxNum );
				break;
				
		};
	}
	else if ( Band == BAND_ON_5G )
	{
		switch ( RateSection ) {
			case OFDM:
				value = pHalData->TxPwrByRateBase5G[RfPath][TxNum][0];
				break;
			case HT_MCS0_MCS7:
				value = pHalData->TxPwrByRateBase5G[RfPath][TxNum][1];
				break;
			case HT_MCS8_MCS15:
				value = pHalData->TxPwrByRateBase5G[RfPath][TxNum][2];
				break;
			case HT_MCS16_MCS23:
				value = pHalData->TxPwrByRateBase5G[RfPath][TxNum][3];
				break;
			case HT_MCS24_MCS31:
				value = pHalData->TxPwrByRateBase5G[RfPath][TxNum][4];
				break;
			case VHT_1SSMCS0_1SSMCS9:
				value = pHalData->TxPwrByRateBase5G[RfPath][TxNum][5];
				break;
			case VHT_2SSMCS0_2SSMCS9:
				value = pHalData->TxPwrByRateBase5G[RfPath][TxNum][6];
				break;
			case VHT_3SSMCS0_3SSMCS9:
				value = pHalData->TxPwrByRateBase5G[RfPath][TxNum][7];
				break;
			case VHT_4SSMCS0_4SSMCS9:
				value = pHalData->TxPwrByRateBase5G[RfPath][TxNum][8];
				break;
			default:
				DBG_871X("Invalid RateSection %d in Band 5G, Rf Path %d, %dTx in PHY_GetTxPowerByRateBase()\n", 
						 RateSection, RfPath, TxNum );
				break;
		};
	}
	else
	{
		DBG_871X("Invalid Band %d in PHY_GetTxPowerByRateBase()\n", Band );
	}

	return value;
}

VOID
phy_SetTxPowerByRateBase(
	IN	PADAPTER		Adapter,
	IN	u8				Band,
	IN	u8				RfPath,
	IN	RATE_SECTION	RateSection,
	IN	u8				TxNum,
	IN	u8				Value
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	
	if ( RfPath > ODM_RF_PATH_D )
	{
		DBG_871X("Invalid Rf Path %d in phy_SetTxPowerByRatBase()\n", RfPath );
		return;
	}
	
	if ( Band == BAND_ON_2_4G )
	{
		switch ( RateSection ) {
			case CCK:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][0] = Value;
				break;
			case OFDM:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][1] = Value;
				break;
			case HT_MCS0_MCS7:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][2] = Value;
				break;
			case HT_MCS8_MCS15:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][3] = Value;
				break;
			case HT_MCS16_MCS23:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][4] = Value;
				break;
			case HT_MCS24_MCS31:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][5] = Value;
				break;
			case VHT_1SSMCS0_1SSMCS9:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][6] = Value;
				break;
			case VHT_2SSMCS0_2SSMCS9:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][7] = Value;
				break;
			case VHT_3SSMCS0_3SSMCS9:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][8] = Value;
				break;
			case VHT_4SSMCS0_4SSMCS9:
				pHalData->TxPwrByRateBase2_4G[RfPath][TxNum][9] = Value;
				break;
			default:
				DBG_871X("Invalid RateSection %d in Band 2.4G, Rf Path %d, %dTx in phy_SetTxPowerByRateBase()\n", 
						 RateSection, RfPath, TxNum );
				break;
		};
	}
	else if ( Band == BAND_ON_5G )
	{
		switch ( RateSection ) {
			case OFDM:
				pHalData->TxPwrByRateBase5G[RfPath][TxNum][0] = Value;
				break;
			case HT_MCS0_MCS7:
				pHalData->TxPwrByRateBase5G[RfPath][TxNum][1] = Value;
				break;
			case HT_MCS8_MCS15:
				pHalData->TxPwrByRateBase5G[RfPath][TxNum][2] = Value;
				break;
			case HT_MCS16_MCS23:
				pHalData->TxPwrByRateBase5G[RfPath][TxNum][3] = Value;
				break;
			case HT_MCS24_MCS31:
				pHalData->TxPwrByRateBase5G[RfPath][TxNum][4] = Value;
				break;
			case VHT_1SSMCS0_1SSMCS9:
				pHalData->TxPwrByRateBase5G[RfPath][TxNum][5] = Value;
				break;
			case VHT_2SSMCS0_2SSMCS9:
				pHalData->TxPwrByRateBase5G[RfPath][TxNum][6] = Value;
				break;
			case VHT_3SSMCS0_3SSMCS9:
				pHalData->TxPwrByRateBase5G[RfPath][TxNum][7] = Value;
				break;
			case VHT_4SSMCS0_4SSMCS9:
				pHalData->TxPwrByRateBase5G[RfPath][TxNum][8] = Value;
				break;
			default:
				DBG_871X("Invalid RateSection %d in Band 5G, Rf Path %d, %dTx in phy_SetTxPowerByRateBase()\n", 
						 RateSection, RfPath, TxNum );
				break;
		};
	}
	else
	{
		DBG_871X("Invalid Band %d in phy_SetTxPowerByRateBase()\n", Band );
	}
}

VOID
phy_StoreTxPowerByRateBaseOld(	
	IN	PADAPTER	pAdapter
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA( pAdapter );
	u16			rawValue = 0;
	u8			base = 0;
	u8			path = 0;

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][7] >> 8 ) & 0xFF; 
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	phy_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_A, CCK, RF_1TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][1] >> 24 ) & 0xFF; 
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	phy_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_A, OFDM, RF_1TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][3] >> 24 ) & 0xFF; 
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	phy_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_A, HT_MCS0_MCS7, RF_1TX, base );

