jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/hal/hal_com_phycfg.c
	if (IS_HARDWARE_TYPE_8813A(pAdapter)) {
	}
	else if (IS_HARDWARE_TYPE_JAGUAR(pAdapter)) {
#if ((RTL8812A_SUPPORT==1) || (RTL8821A_SUPPORT == 1))
		txPower = PHY_GetTxPowerIndex_8812A(pAdapter, RFPath, Rate, BandWidth, Channel);
#endif
	}
	else if (IS_HARDWARE_TYPE_8723B(pAdapter)) {
#if (RTL8723B_SUPPORT==1)
		txPower = PHY_GetTxPowerIndex_8723B(pAdapter, RFPath, Rate, BandWidth, Channel);
#endif
	}
	else if (IS_HARDWARE_TYPE_8192E(pAdapter)) {
#if (RTL8192E_SUPPORT==1)
		txPower = PHY_GetTxPowerIndex_8192E(pAdapter, RFPath, Rate, BandWidth, Channel);
#endif
	}
	else if (IS_HARDWARE_TYPE_8188E(pAdapter)) {
#if (RTL8188E_SUPPORT==1)
		txPower = PHY_GetTxPowerIndex_8188E(pAdapter, RFPath, Rate, BandWidth, Channel);
#endif
	}

	return txPower;
}

VOID
PHY_SetTxPowerIndex(
	IN	PADAPTER		pAdapter,
	IN	u32				PowerIndex,
	IN	u8				RFPath,	
	IN	u8				Rate
	)
{
	if (IS_HARDWARE_TYPE_8813A(pAdapter)) {
	}
	else if (IS_HARDWARE_TYPE_JAGUAR(pAdapter)) {
#if ((RTL8812A_SUPPORT==1) || (RTL8821A_SUPPORT == 1))
		PHY_SetTxPowerIndex_8812A( pAdapter, PowerIndex, RFPath, Rate );
#endif
	}
	else if (IS_HARDWARE_TYPE_8723B(pAdapter)) {
#if (RTL8723B_SUPPORT==1)
		PHY_SetTxPowerIndex_8723B( pAdapter, PowerIndex, RFPath, Rate );
#endif
	}
	else if (IS_HARDWARE_TYPE_8192E(pAdapter)) {
#if (RTL8192E_SUPPORT==1)
		PHY_SetTxPowerIndex_8192E( pAdapter, PowerIndex, RFPath, Rate );
#endif
	}
	else if (IS_HARDWARE_TYPE_8188E(pAdapter)) {
#if (RTL8188E_SUPPORT==1)
		PHY_SetTxPowerIndex_8188E( pAdapter, PowerIndex, RFPath, Rate );
#endif
	}
}

VOID
Hal_ChannelPlanToRegulation(
	IN	PADAPTER		Adapter,
	IN	u16				ChannelPlan
	)
{
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA(Adapter);
	pHalData->Regulation2_4G = TXPWR_LMT_WW;
	pHalData->Regulation5G = TXPWR_LMT_WW;

	switch(ChannelPlan)
	{	
		case RT_CHANNEL_DOMAIN_WORLD_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_WW;	
			break;
		case RT_CHANNEL_DOMAIN_ETSI1_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_MKK1_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_MKK;
			break;
		case RT_CHANNEL_DOMAIN_ETSI2_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC1:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI1:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_MKK1_MKK1:
			pHalData->Regulation2_4G = TXPWR_LMT_MKK;
			pHalData->Regulation5G = TXPWR_LMT_MKK;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_KCC1:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_MKK;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC2:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
					break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC3:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC4:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC5:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC6:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC7:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI2:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI3:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_MKK1_MKK2:
			pHalData->Regulation2_4G = TXPWR_LMT_MKK;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_MKK1_MKK3:
			pHalData->Regulation2_4G = TXPWR_LMT_MKK;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NCC1:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NCC2:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_GLOBAL_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_WW;
			pHalData->Regulation5G = TXPWR_LMT_WW;
			break;
		case RT_CHANNEL_DOMAIN_ETSI1_ETSI4:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC2:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NCC3:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI5:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC8:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI6:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI7:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI8:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI9:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI10:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI11:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NCC4:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI12:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC9:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI13:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC10:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_REALTEK_DEFINE:
			pHalData->Regulation2_4G = TXPWR_LMT_WW;
			pHalData->Regulation5G = TXPWR_LMT_WW;
			break;
		default:
			break;
	}
}

